_Rarzrabotki/Rarus/USO2/ExchangePlans/СМ_WS_Обмен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<ExchangePlan>
		<Properties>
			<Name>СМ_WS_Обмен</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОбъектыСтроительства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьКонтрагентовИДоговоры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЦеныРесурсов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьАкты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыРесурсов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРесурса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/ExchangePlans/СМ_WS_Обмен/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СопоставлениеОбъектов(Команда)
	Тек=Элементы.Список.ТекущиеДанные;
	Если Тек<>Неопределено Тогда
	ОткрытьФорму("ПланОбмена.СМ_WS_Обмен.Форма.ФормаСопоставлениеОбъектов",Новый Структура("Ключ",Элементы.Список.ТекущаяСтрока));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписание(Команда)
	Если Элементы.Список.ТекущаяСтрока<>Неопределено Тогда
		
		РасписаниеРегламентногоЗадания = ПолучитьРасписаниеВыполненияОбменаДанными(Элементы.Список.ТекущаяСтрока);
		
		Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеРасписанияРегламентногоЗаданияЗавершение", ЭтаФорма);
		Диалог.Показать(ОписаниеОповещения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьРасписание(Команда)
	Если Элементы.Список.ТекущаяСтрока<>Неопределено Тогда
		ОтключитьРегламентноеЗадание(Элементы.Список.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	СМ_WS_ВызовСервера.СМ_WS_ВыполнитьОбмен();
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьОстатки(Команда)
	Тек=Элементы.Список.ТекущиеДанные;
	Если Тек<>Неопределено Тогда
	ОткрытьФорму("ПланОбмена.СМ_WS_Обмен.Форма.ПросмотрОстатков",Новый Структура("Ключ",Элементы.Список.ТекущаяСтрока));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РедактированиеРасписанияРегламентногоЗаданияЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание <> Неопределено И Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		ОбновитьДанныеРегламентногоЗадания(Расписание,Элементы.Список.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеРегламентногоЗадания(РасписаниеРегламентногоЗадания, Узел)
	
	РегламентноеЗаданиеОбъект = Неопределено;
	ТекущийОбъект = Узел.ПолучитьОбъект();
	
	Если Узел.РегламентноеЗаданиеGUID<>"" Тогда
		РегламентноеЗаданиеОбъект = ОбменДаннымиВызовСервера.НайтиРегламентноеЗаданиеПоПараметру(Узел.РегламентноеЗаданиеGUID);
	КонецЕсли;
	
	ТекущийОбъект.ИспользоватьРегламентноеЗадание=Истина;

	// При необходимости создаем регламентное задание.
	Если РегламентноеЗаданиеОбъект = Неопределено Тогда
		РегламентноеЗаданиеОбъект = РегламентныеЗадания.СоздатьРегламентноеЗадание("СМ_WS_Обмен");
	КонецЕсли;

	// обновляем свойства РЗ
	УстановитьПараметрыРегламентногоЗадания(РегламентноеЗаданиеОбъект, РасписаниеРегламентногоЗадания, ТекущийОбъект);
	
	// Записываем измененное задание.
	Отказ=Ложь;
	ЗаписатьРегламентноеЗадание(Отказ, РегламентноеЗаданиеОбъект);
	
	// Запоминаем GUID регламентное задания в реквизите объекта.
	Если Не Отказ Тогда
		ТекущийОбъект.РегламентноеЗаданиеGUID = Строка(РегламентноеЗаданиеОбъект.УникальныйИдентификатор);
	    ТекущийОбъект.Записать();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыРегламентногоЗадания(РегламентноеЗаданиеОбъект, РасписаниеРегламентногоЗадания, ТекущийОбъект)
	
	
	ПараметрыРегламентногоЗадания = Новый Массив;
	ПараметрыРегламентногоЗадания.Добавить(ТекущийОбъект.Наименование);
	
	НаименованиеРегламентногоЗадания = ТекущийОбъект.Наименование;
	
	
	РегламентноеЗаданиеОбъект.Наименование  = Лев(НаименованиеРегламентногоЗадания, 120);
	РегламентноеЗаданиеОбъект.Использование = ТекущийОбъект.ИспользоватьРегламентноеЗадание;
	РегламентноеЗаданиеОбъект.Параметры     = ПараметрыРегламентногоЗадания;
	
	// Обновляем расписание, если оно было изменено.
	Если РасписаниеРегламентногоЗадания <> Неопределено Тогда
		РегламентноеЗаданиеОбъект.Расписание = РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРегламентноеЗадание(Отказ, РегламентноеЗаданиеОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		// записываем задание
		РегламентноеЗаданиеОбъект.Записать();
		
	Исключение
		
		СтрокаСообщения = НСтр("ru = 'Произошла ошибка при сохранении расписания выполнения обменов. Подробное описание ошибки: "+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке())+"'");
		Отказ=Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасписаниеВыполненияОбменаДанными(Узел)
	
	Если Узел.РегламентноеЗаданиеGUID<>"" Тогда

		РегламентноеЗаданиеОбъект = ОбменДаннымиВызовСервера.НайтиРегламентноеЗаданиеПоПараметру(Узел.РегламентноеЗаданиеGUID); 
		
		Если РегламентноеЗаданиеОбъект <> Неопределено Тогда
			
			РасписаниеРегламентногоЗадания = РегламентноеЗаданиеОбъект.Расписание;
			
		Иначе
			
			РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
			
		КонецЕсли;
	иначе
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КОнецЕсли;
	
	Возврат РасписаниеРегламентногоЗадания;
	
КонецФункции

&НаСервере
Процедура ОтключитьРегламентноеЗадание(Узел)
	
	РегламентноеЗаданиеОбъект=Неопределено;
	ТекущийОбъект=Неопределено;
	Если Узел.РегламентноеЗаданиеGUID<>"" Тогда
		
		РегламентноеЗаданиеОбъект = ОбменДаннымиВызовСервера.НайтиРегламентноеЗаданиеПоПараметру(Узел.РегламентноеЗаданиеGUID);
		
		ТекущийОбъект = Узел.ПолучитьОбъект();
		ТекущийОбъект.ИспользоватьРегламентноеЗадание=Ложь;
		ТекущийОбъект.Записать();
		 
		Если РегламентноеЗаданиеОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Отказ = Ложь;
		РегламентноеЗаданиеОбъект.Использование = ТекущийОбъект.ИспользоватьРегламентноеЗадание;
		ЗаписатьРегламентноеЗадание(Отказ, РегламентноеЗаданиеОбъект);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
